tap "amberframework/amber"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
tap "stripe/stripe-cli"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Extendable version manager with support for Ruby, Node.js, Erlang & more
brew "asdf"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Tool Command Language
brew "tcl-tk"
# Vector graphics library with cross-device output support
brew "cairo"
# Cross-platform make
brew "cmake"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Command-line tool to interact with exercism.io
brew "exercism"
# Validating, recursive, caching DNS resolver
brew "unbound"
# OpenType text shaping engine
brew "harfbuzz"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Framework for layout and rendering of i18n text
brew "pango"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Text-based web browser
brew "lynx"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# GUI for vim, made for macOS
brew "macvim"
# Open source relational database management system
brew "mysql"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# User interface to the TELNET protocol
brew "telnet"
# Code-search similar to ack
brew "the_silver_searcher"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# A tool to manage rack apps in development with puma
brew "puma/puma/puma-dev"
# Stripe CLI utility
brew "stripe/stripe-cli/stripe"
cask "font-hack-nerd-font"
cask "font-source-code-pro"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
